--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\hp\Desktop\Econometrics-End-Term-Project\Question_1\Q1.log
  log type:  text
 opened on:   2 Dec 2020, 23:05:58

. import excel "C:\Users\hp\Desktop\Econometrics-End-Term-Project\Question_1\sco
> res_data.xlsx", sheet("Sheet1") firstrow clear

. codebook course_result

--------------------------------------------------------------------------------
course_result                                                      course_result
--------------------------------------------------------------------------------

                  type:  string (str4)

         unique values:  2                        missing "":  0/36

            tabulation:  Freq.  Value
                            17  "Fail"
                            19  "Pass"

. 
. 
. 
. codebook test_score

--------------------------------------------------------------------------------
test_score                                                            test_score
--------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [9,80]                       units:  1
         unique values:  29                       missing .:  0/36

                  mean:   46.8889
              std. dev:   18.5992

           percentiles:        10%       25%       50%       75%       90%
                                26      31.5        44        62        70

. replace course_result="1" if course_result=="Pass"
(19 real changes made)

. 
. 
. 
. replace course_result="0" if course_result=="Fail"
(17 real changes made)

. 
. 
. 
. destring course_result, replace
course_result has all characters numeric; replaced as byte

. 
. 
. 
. list

     +-------------------------------+
     | student   test_s~e   course~t |
     |-------------------------------|
  1. |       1         30          0 |
  2. |       2         29          1 |
  3. |       3         33          0 |
  4. |       4         62          1 |
  5. |       5         59          0 |
     |-------------------------------|
  6. |       6         63          1 |
  7. |       7         80          1 |
  8. |       8         32          0 |
  9. |       9         60          1 |
 10. |      10         76          1 |
     |-------------------------------|
 11. |      11         13          0 |
 12. |      12         41          1 |
 13. |      13         26          0 |
 14. |      14         43          1 |
 15. |      15         43          0 |
     |-------------------------------|
 16. |      16         68          1 |
 17. |      17         63          1 |
 18. |      18         42          0 |
 19. |      19         51          0 |
 20. |      20         45          0 |
     |-------------------------------|
 21. |      21         22          0 |
 22. |      22         30          1 |
 23. |      23         40          0 |
 24. |      24         26          0 |
 25. |      25          9          0 |
     |-------------------------------|
 26. |      26         36          1 |
 27. |      27         61          1 |
 28. |      28         79          0 |
 29. |      29         57          0 |
 30. |      30         46          1 |
     |-------------------------------|
 31. |      31         70          0 |
 32. |      32         31          1 |
 33. |      33         68          1 |
 34. |      34         62          1 |
 35. |      35         56          1 |
     |-------------------------------|
 36. |      36         36          1 |
     +-------------------------------+

. 
. 
. 
. reg course_result test_score

      Source |       SS       df       MS              Number of obs =      36
-------------+------------------------------           F(  1,    34) =    5.21
       Model |  1.19154349     1  1.19154349           Prob > F      =  0.0289
    Residual |  7.78067873    34  .228843492           R-squared     =  0.1328
-------------+------------------------------           Adj R-squared =  0.1073
       Total |  8.97222222    35  .256349206           Root MSE      =  .47838

------------------------------------------------------------------------------
course_res~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  test_score |   .0099203   .0043475     2.28   0.029     .0010851    .0187556
       _cons |   .0626239   .2188873     0.29   0.777    -.3822086    .5074563
------------------------------------------------------------------------------

. graph twoway scatter course_result test_score

. log close
      name:  <unnamed>
       log:  C:\Users\hp\Desktop\Econometrics-End-Term-Project\Question_1\Q1.log
  log type:  text
 closed on:   2 Dec 2020, 23:08:35
--------------------------------------------------------------------------------
