----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\hp\Desktop\Study Material (SNU)\Semester 5\ECO 213 - Basic Data Analysis and Econometrics\End_Term_Project\Q
> uestion_2\Q2.log
  log type:  text
 opened on:  15 Nov 2020, 19:35:02

. use "C:\Users\hp\Desktop\Study Material (SNU)\Semester 5\ECO 213 - Basic Data Analysis and Econometrics\End_Term_Project\Questio
> n_2\EAWE22.dta", clear

. codebook ASVABC, SM, SF, MALE
invalid 'SF' 
r(198);

. codebook ASVABC SM SF MALE

----------------------------------------------------------------------------------------------------------------------------------
ASVABC                                                                                                                 (unlabeled)
----------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [-3.0534713,2.1394458]       units:  1.000e-10
         unique values:  500                      missing .:  0/500

                  mean:   .150069
              std. dev:   .965624

           percentiles:        10%       25%       50%       75%       90%
                          -1.03842  -.401046   .239178   .831756   1.33922

----------------------------------------------------------------------------------------------------------------------------------
SM                                                                                                                              SM
----------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [2,20]                       units:  1
         unique values:  18                       missing .:  0/500

                  mean:    13.192
              std. dev:   2.58079

           percentiles:        10%       25%       50%       75%       90%
                                11        12        12        15        16

----------------------------------------------------------------------------------------------------------------------------------
SF                                                                                                                              SF
----------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [3,20]                       units:  1
         unique values:  18                       missing .:  0/500

                  mean:    13.302
              std. dev:   3.01811

           percentiles:        10%       25%       50%       75%       90%
                                11        12        12        16        18

----------------------------------------------------------------------------------------------------------------------------------
MALE                                                                                                                   (unlabeled)
----------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/500

            tabulation:  Freq.  Value
                           250  0
                           250  1

. reg S ASVABC SM SF MALE

      Source |       SS       df       MS              Number of obs =     500
-------------+------------------------------           F(  4,   495) =   68.81
       Model |  1366.22524     4   341.55631           Prob > F      =  0.0000
    Residual |  2457.20676   495  4.96405406           R-squared     =  0.3573
-------------+------------------------------           Adj R-squared =  0.3521
       Total |    3823.432   499  7.66218838           Root MSE      =   2.228

------------------------------------------------------------------------------
           S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ASVABC |    1.20327   .1134408    10.61   0.000     .9803849    1.426155
          SM |   .1745339   .0475472     3.67   0.000     .0811146    .2679532
          SF |   .1121408   .0412465     2.72   0.007      .031101    .1931807
        MALE |  -.8637231   .2016953    -4.28   0.000    -1.260007   -.4674387
       _cons |   10.90114   .5946959    18.33   0.000       9.7327    12.06958
------------------------------------------------------------------------------

. codebook S

----------------------------------------------------------------------------------------------------------------------------------
S                                                                                                                      (unlabeled)
----------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [7,20]                       units:  1
         unique values:  14                       missing .:  0/500

                  mean:    14.444
              std. dev:   2.76807

           percentiles:        10%       25%       50%       75%       90%
                                11        12        14        16        18

. gen MALESVC = MALE*ASVABC

. codebook MALESVC

----------------------------------------------------------------------------------------------------------------------------------
MALESVC                                                                                                                (unlabeled)
----------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [-3.0534713,2.1394458]       units:  1.000e-10
         unique values:  251                      missing .:  0/500

                  mean:   .031514
              std. dev:   .752296

           percentiles:        10%       25%       50%       75%       90%
                          -.770043         0         0   .185418    .96592

. gen MALEASVC = MALE*ASVABC

. reg S ASVABC SM SF ETHBLACK ETHHISP MALE MALEASVC

      Source |       SS       df       MS              Number of obs =     500
-------------+------------------------------           F(  7,   492) =   39.94
       Model |  1385.40323     7  197.914747           Prob > F      =  0.0000
    Residual |  2438.02877   492  4.95534302           R-squared     =  0.3623
-------------+------------------------------           Adj R-squared =  0.3533
       Total |    3823.432   499  7.66218838           Root MSE      =  2.2261

------------------------------------------------------------------------------
           S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ASVABC |   1.429119   .1799642     7.94   0.000     1.075526    1.782712
          SM |    .169832   .0481066     3.53   0.000     .0753124    .2643517
          SF |   .1151782   .0419478     2.75   0.006     .0327593    .1975972
    ETHBLACK |   .5273355   .3402949     1.55   0.122     -.141275    1.195946
     ETHHISP |   .1908784   .3331779     0.57   0.567    -.4637486    .8455055
        MALE |  -.7898663   .2057337    -3.84   0.000    -1.194091   -.3856413
    MALEASVC |  -.2629244   .2132621    -1.23   0.218    -.6819412    .1560924
       _cons |   10.77864   .6389329    16.87   0.000     9.523269    12.03402
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  C:\Users\hp\Desktop\Study Material (SNU)\Semester 5\ECO 213 - Basic Data Analysis and Econometrics\End_Term_Project\Q
> uestion_2\Q2.log
  log type:  text
 closed on:  15 Nov 2020, 20:07:36
----------------------------------------------------------------------------------------------------------------------------------
