--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\hp\Desktop\Econometrics-End-Term-Project\Question_2\Q2(1).
> log
  log type:  text
 opened on:   4 Dec 2020, 19:43:45

. use "C:\Users\hp\Desktop\Econometrics-End-Term-Project\Question_2\EAWE22.dta",
>  clear

. codebook ASVABC SM SF MALE

--------------------------------------------------------------------------------
ASVABC                                                               (unlabeled)
--------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [-3.0534713,2.1394458]       units:  1.000e-10
         unique values:  500                      missing .:  0/500

                  mean:   .150069
              std. dev:   .965624

           percentiles:        10%       25%       50%       75%       90%
                          -1.03842  -.401046   .239178   .831756   1.33922

--------------------------------------------------------------------------------
SM                                                                            SM
--------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [2,20]                       units:  1
         unique values:  18                       missing .:  0/500

                  mean:    13.192
              std. dev:   2.58079

           percentiles:        10%       25%       50%       75%       90%
                                11        12        12        15        16

--------------------------------------------------------------------------------
SF                                                                            SF
--------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [3,20]                       units:  1
         unique values:  18                       missing .:  0/500

                  mean:    13.302
              std. dev:   3.01811

           percentiles:        10%       25%       50%       75%       90%
                                11        12        12        16        18

--------------------------------------------------------------------------------
MALE                                                                 (unlabeled)
--------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/500

            tabulation:  Freq.  Value
                           250  0
                           250  1

. reg S ASVABC SM SF MALE

      Source |       SS       df       MS              Number of obs =     500
-------------+------------------------------           F(  4,   495) =   68.81
       Model |  1366.22524     4   341.55631           Prob > F      =  0.0000
    Residual |  2457.20676   495  4.96405406           R-squared     =  0.3573
-------------+------------------------------           Adj R-squared =  0.3521
       Total |    3823.432   499  7.66218838           Root MSE      =   2.228

------------------------------------------------------------------------------
           S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ASVABC |    1.20327   .1134408    10.61   0.000     .9803849    1.426155
          SM |   .1745339   .0475472     3.67   0.000     .0811146    .2679532
          SF |   .1121408   .0412465     2.72   0.007      .031101    .1931807
        MALE |  -.8637231   .2016953    -4.28   0.000    -1.260007   -.4674387
       _cons |   10.90114   .5946959    18.33   0.000       9.7327    12.06958
------------------------------------------------------------------------------

. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
          SF |      1.56    0.641933
          SM |      1.51    0.660665
      ASVABC |      1.21    0.829050
        MALE |      1.02    0.976192
-------------+----------------------
    Mean VIF |      1.33

. reg ASVABC SM SF MALE

      Source |       SS       df       MS              Number of obs =     500
-------------+------------------------------           F(  3,   496) =   34.09
       Model |   79.539904     3  26.5133013           Prob > F      =  0.0000
    Residual |  385.742622   496    .7777069           R-squared     =  0.1709
-------------+------------------------------           Adj R-squared =  0.1659
       Total |  465.282526   499  .932429913           Root MSE      =  .88188

------------------------------------------------------------------------------
      ASVABC |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          SM |   .0733703   .0185292     3.96   0.000     .0369649    .1097757
          SF |   .0831055   .0158937     5.23   0.000     .0518782    .1143328
        MALE |  -.2118789   .0792647    -2.67   0.008    -.3676148    -.056143
       _cons |  -1.817363   .2207911    -8.23   0.000    -2.251164   -1.383562
------------------------------------------------------------------------------

. reg SM ASVABC SF MALE

      Source |       SS       df       MS              Number of obs =     500
-------------+------------------------------           F(  3,   496) =   84.92
       Model |  1127.80148     3  375.933826           Prob > F      =  0.0000
    Residual |  2195.76652   496  4.42694863           R-squared     =  0.3393
-------------+------------------------------           Adj R-squared =  0.3353
       Total |    3323.568   499  6.66045691           Root MSE      =   2.104

------------------------------------------------------------------------------
          SM |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ASVABC |   .4176467    .105474     3.96   0.000     .2104158    .6248776
          SF |   .4344969   .0337132    12.89   0.000     .3682586    .5007351
        MALE |  -.1581159    .190339    -0.83   0.407     -.532086    .2158542
       _cons |   7.428705   .4518139    16.44   0.000        6.541     8.31641
------------------------------------------------------------------------------

. reg SF SM ASVABC MALE

      Source |       SS       df       MS              Number of obs =     500
-------------+------------------------------           F(  3,   496) =   92.22
       Model |  1627.55559     3  542.518528           Prob > F      =  0.0000
    Residual |  2917.84241   496   5.8827468           R-squared     =  0.3581
-------------+------------------------------           Adj R-squared =  0.3542
       Total |    4545.398   499  9.10901403           Root MSE      =  2.4254

------------------------------------------------------------------------------
          SF |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          SM |   .5773808   .0447997    12.89   0.000     .4893601    .6654014
      ASVABC |   .6286284   .1202236     5.23   0.000      .392418    .8648388
        MALE |   .5992898   .2179121     2.75   0.006     .1711452    1.027434
       _cons |   5.291211   .6022208     8.79   0.000     4.107992    6.474429
------------------------------------------------------------------------------

. reg MALE SF ASVABC SM

      Source |       SS       df       MS              Number of obs =     500
-------------+------------------------------           F(  3,   496) =    4.03
       Model |  2.97603695     3  .992012315           Prob > F      =  0.0075
    Residual |  122.023963   496  .246016055           R-squared     =  0.0238
-------------+------------------------------           Adj R-squared =  0.0179
       Total |         125   499  .250501002           Root MSE      =    .496

------------------------------------------------------------------------------
        MALE |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          SF |   .0250623   .0091131     2.75   0.006     .0071573    .0429672
      ASVABC |  -.0670248   .0250742    -2.67   0.008    -.1162895     -.01776
          SM |  -.0087869   .0105776    -0.83   0.407    -.0295693    .0119955
       _cons |   .2925967   .1317375     2.22   0.027     .0337643     .551429
------------------------------------------------------------------------------

. reg SM SF

      Source |       SS       df       MS              Number of obs =     500
-------------+------------------------------           F(  1,   498) =  230.10
       Model |  1050.35026     1  1050.35026           Prob > F      =  0.0000
    Residual |  2273.21774   498  4.56469426           R-squared     =  0.3160
-------------+------------------------------           Adj R-squared =  0.3147
       Total |    3323.568   499  6.66045691           Root MSE      =  2.1365

------------------------------------------------------------------------------
          SM |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          SF |   .4807077   .0316898    15.17   0.000     .4184455      .54297
       _cons |   6.797626   .4322311    15.73   0.000     5.948404    7.646847
------------------------------------------------------------------------------

. correlate ASVABC SM SF
(obs=500)

             |   ASVABC       SM       SF
-------------+---------------------------
      ASVABC |   1.0000
          SM |   0.3426   1.0000
          SF |   0.3613   0.5622   1.0000


. gen MALEASVC = MALE*ASVABC

. reg S ASVABC SM SF ETHBLACK ETHHISP MALE MALEASVC

      Source |       SS       df       MS              Number of obs =     500
-------------+------------------------------           F(  7,   492) =   39.94
       Model |  1385.40323     7  197.914747           Prob > F      =  0.0000
    Residual |  2438.02877   492  4.95534302           R-squared     =  0.3623
-------------+------------------------------           Adj R-squared =  0.3533
       Total |    3823.432   499  7.66218838           Root MSE      =  2.2261

------------------------------------------------------------------------------
           S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ASVABC |   1.429119   .1799642     7.94   0.000     1.075526    1.782712
          SM |    .169832   .0481066     3.53   0.000     .0753124    .2643517
          SF |   .1151782   .0419478     2.75   0.006     .0327593    .1975972
    ETHBLACK |   .5273355   .3402949     1.55   0.122     -.141275    1.195946
     ETHHISP |   .1908784   .3331779     0.57   0.567    -.4637486    .8455055
        MALE |  -.7898663   .2057337    -3.84   0.000    -1.194091   -.3856413
    MALEASVC |  -.2629244   .2132621    -1.23   0.218    -.6819412    .1560924
       _cons |   10.77864   .6389329    16.87   0.000     9.523269    12.03402
------------------------------------------------------------------------------

. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
      ASVABC |      3.04    0.328840
    MALEASVC |      2.59    0.385805
          SF |      1.61    0.619560
          SM |      1.55    0.644259
     ETHHISP |      1.17    0.857829
    ETHBLACK |      1.16    0.860522
        MALE |      1.07    0.936597
-------------+----------------------
    Mean VIF |      1.74

. log close
      name:  <unnamed>
       log:  C:\Users\hp\Desktop\Econometrics-End-Term-Project\Question_2\Q2(1).
> log
  log type:  text
 closed on:   4 Dec 2020, 20:16:10
--------------------------------------------------------------------------------
